In [ ]:
# Hello

In [1]:
import numpy as np
import pandas as pd

In [9]:
index = [
    ('CA', 2000), ('CA', 2010),
    ('NY', 2000), ('NY', 2010),
    ('TX', 2000), ('TX', 2010)
]

populations = [33871648, 37253956,
               18976457, 19378102,
               20851820, 25145561]
pop = pd.Series(populations, index=index)

index

[('CA', 2000),
 ('CA', 2010),
 ('NY', 2000),
 ('NY', 2010),
 ('TX', 2000),
 ('TX', 2010)]

In [10]:
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex([('CA', 2000),
            ('CA', 2010),
            ('NY', 2000),
            ('NY', 2010),
            ('TX', 2000),
            ('TX', 2010)],
           )

In [14]:
pop = pop.reindex(index)
pop

CA  2000    33871648
    2010    37253956
NY  2000    18976457
    2010    19378102
TX  2000    20851820
    2010    25145561
dtype: int64

In [15]:
pop[:, 2010]

CA    37253956
NY    19378102
TX    25145561
dtype: int64

In [16]:
pop_df = pop.unstack()
pop_df

        2000      2010
CA  33871648  37253956
NY  18976457  19378102
TX  20851820  25145561

In [17]:
pop_df = pd.DataFrame(
    {
        'total' : pop,
        'under 18' : [6, 5, 4, 3, 2, 1]
    }
)

pop_df

            total  under 18
CA 2000  33871648         6
   2010  37253956         5
NY 2000  18976457         4
   2010  19378102         3
TX 2000  20851820         2
   2010  25145561         1

In [18]:
fraction_under_18 = pop_df['under 18'] / pop_df['total']
fraction_under_18

CA  2000    1.771393e-07
    2010    1.342139e-07
NY  2000    2.107875e-07
    2010    1.548139e-07
TX  2000    9.591489e-08
    2010    3.976845e-08
dtype: float64

In [19]:
fraction_under_18.unstack()

            2000          2010
CA  1.771393e-07  1.342139e-07
NY  2.107875e-07  1.548139e-07
TX  9.591489e-08  3.976845e-08

In [27]:
J = np.array([[1, 2, 3, 4], [10, 20, 30, 40]]).reshape(4,2)

In [28]:
J

array([[ 1,  2],
       [ 3,  4],
       [10, 20],
       [30, 40]])

In [35]:
df = pd.DataFrame(J,
                 index = [['a', 'b', 'c', 'd'], [1, 2, 1, 2]],
                columns=['D1', 'D2']
                 )

In [36]:
df

     D1  D2
a 1   1   2
b 2   3   4
c 1  10  20
d 2  30  40

In [37]:
data = {('California', 2000): 33871648,
        ('California', 2010): 37253956,
        ('Texas', 2000): 20851820,
        ('Texas', 2010): 25145561,
        ('New York', 2000): 18976457,
        ('New York', 2010): 19378102}

In [39]:
M = pd.Series(data)
M

California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
New York    2000    18976457
            2010    19378102
dtype: int64

In [41]:
M.index

MultiIndex([('California', 2000),
            ('California', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010),
            (  'New York', 2000),
            (  'New York', 2010)],
           )

In [45]:
M[:, 2010]

California    37253956
Texas         25145561
New York      19378102
dtype: int64

In [52]:
# Array
a = ([['a', 'a', 'b', 'b'], [1, 2, 1, 2]])

# Tuple
b = ([('a', 1),
      ('a', 2),
      ('b', 1),
      ('b', 2)
     ])

# Indices:
c = ([
    ['a', 'b'],
    [1, 2]
])

In [48]:
pd.MultiIndex.from_arrays(a)

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [51]:
pd.MultiIndex.from_tuples(b)

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [53]:
pd.MultiIndex.from_product(c)

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [56]:
pop.index.names = ['State', 'Year']
pop

State  Year
CA     2000    33871648
       2010    37253956
NY     2000    18976457
       2010    19378102
TX     2000    20851820
       2010    25145561
dtype: int64

In [97]:
# hierarchical indices and columns
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
                                   names=['R1_year', 'R2_visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
                                     names=['C1_ subject', 'C2_type'])

print("Index:\n", index)
print("\n\nColumns:\n", columns)

Index:
 MultiIndex([(2013, 1),
            (2013, 2),
            (2014, 1),
            (2014, 2)],
           names=['R1_year', 'R2_visit'])


Columns:
 MultiIndex([(  'Bob',   'HR'),
            (  'Bob', 'Temp'),
            ('Guido',   'HR'),
            ('Guido', 'Temp'),
            (  'Sue',   'HR'),
            (  'Sue', 'Temp')],
           names=['C1_ subject', 'C2_type'])

In [98]:
data = np.random.randint(1, 100, (4,6))
data

array([[93,  8, 42, 72,  4, 52],
       [17, 48, 84, 95, 16, 28],
       [88, 37, 69, 77, 11, 45],
       [51,  2,  9, 45, 80, 90]])

In [99]:
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

C1_ subject      Bob      Guido      Sue
C2_type           HR Temp    HR Temp  HR Temp
R1_year R2_visit
2013    1         93    8    42   72   4   52
        2         17   48    84   95  16   28
2014    1         88   37    69   77  11   45
        2         51    2     9   45  80   90

In [76]:
health_data['Sue']

type          HR  Temp
year visit
2013 1      42.0  36.9
     2      36.0  35.3
2014 1      35.0  37.5
     2      37.0  35.1

In [77]:
# Indexing and slicing

In [78]:
pop

State  Year
CA     2000    33871648
       2010    37253956
NY     2000    18976457
       2010    19378102
TX     2000    20851820
       2010    25145561
dtype: int64

In [79]:
pop['NY', 2010]

19378102

In [80]:
pop['CA']

Year
2000    33871648
2010    37253956
dtype: int64

In [82]:
pop['CA' : 'TX']

State  Year
CA     2000    33871648
       2010    37253956
NY     2000    18976457
       2010    19378102
TX     2000    20851820
       2010    25145561
dtype: int64

In [83]:
pop[:, 2000]

State
CA    33871648
NY    18976457
TX    20851820
dtype: int64

In [87]:
pop[pop>22000000]

State  Year
CA     2000    33871648
       2010    37253956
TX     2010    25145561
dtype: int64

In [89]:
pop[['CA', 'TX']]

State  Year
CA     2000    33871648
       2010    37253956
TX     2000    20851820
       2010    25145561
dtype: int64

In [90]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      26.0  36.9  27.0  37.4  42.0  36.9
     2      26.0  37.2  32.0  39.5  36.0  35.3
2014 1      17.0  35.0  37.0  37.1  35.0  37.5
     2      39.0  36.5  47.0  36.2  37.0  35.1

In [100]:
health_data['Guido', 'HR']

R1_year  R2_visit
2013     1           42
         2           84
2014     1           69
         2            9
Name: (Guido, HR), dtype: int64

In [102]:
health_data.iloc[:2, :2]

C1_ subject      Bob
C2_type           HR Temp
R1_year R2_visit
2013    1         93    8
        2         17   48

In [109]:
health_data.loc[:, [('Guido', 'Temp'), ('Sue', 'HR')]]

C1_ subject      Guido Sue
C2_type           Temp  HR
R1_year R2_visit
2013    1           72   4
        2           95  16
2014    1           77  11
        2           45  80

In [115]:
health_data.loc[(:, 1), (:,'HR')]

SyntaxError: invalid syntax (<ipython-input-115-b57f13157a4e>, line 1)

In [116]:
idx = pd.IndexSlice
health_data.loc[idx[:, 1], idx[:, 'HR']]

C1_ subject      Bob Guido Sue
C2_type           HR    HR  HR
R1_year R2_visit
2013    1         93    42   4
2014    1         88    69  11

In [126]:
Index = [('a', 1), ('a', 2), ('b', 1), ('b', 2), ('c', 1), ('c', 2)]
Index = pd.MultiIndex.from_tuples(Index)
data = pd.Series(np.random.randint(1,6, (6)), index = Index).sort_index()
data

a  1    1
   2    5
b  1    2
   2    5
c  1    4
   2    4
dtype: int64

In [127]:
data.index.names = ['char', 'int']
data

char  int
a     1      1
      2      5
b     1      2
      2      5
c     1      4
      2      4
dtype: int64

In [128]:
data['a':'b']

char  int
a     1      1
      2      5
b     1      2
      2      5
dtype: int64

In [138]:
pop.unstack(level=1)

Year       2000      2010
State
CA     33871648  37253956
NY     18976457  19378102
TX     20851820  25145561

In [141]:
pop.unstack().stack()

State  Year
CA     2000    33871648
       2010    37253956
NY     2000    18976457
       2010    19378102
TX     2000    20851820
       2010    25145561
dtype: int64

In [144]:
pop_flat = pop.reset_index(name = 'Population')

In [154]:
pop_flat

  State  Year  Population
0    CA  2000    33871648
1    CA  2010    37253956
2    NY  2000    18976457
3    NY  2010    19378102
4    TX  2000    20851820
5    TX  2010    25145561

In [146]:
pop_flat.set_index(['State', 'Year'])

            Population
State Year
CA    2000    33871648
      2010    37253956
NY    2000    18976457
      2010    19378102
TX    2000    20851820
      2010    25145561

In [156]:
pop_flat['State']

0    CA
1    CA
2    NY
3    NY
4    TX
5    TX
Name: State, dtype: object

In [157]:
health_data

C1_ subject      Bob      Guido      Sue
C2_type           HR Temp    HR Temp  HR Temp
R1_year R2_visit
2013    1         93    8    42   72   4   52
        2         17   48    84   95  16   28
2014    1         88   37    69   77  11   45
        2         51    2     9   45  80   90

In [159]:
health_data.mean(level='R1_year')

C1_ subject   Bob       Guido         Sue
C2_type        HR  Temp    HR  Temp    HR  Temp
R1_year
2013         55.0  28.0  63.0  83.5  10.0  40.0
2014         69.5  19.5  39.0  61.0  45.5  67.5

In [165]:
health_data.mean(axis = 0, level='R2_visit')

C1_ subject   Bob       Guido         Sue
C2_type        HR  Temp    HR  Temp    HR  Temp
R2_visit
1            90.5  22.5  55.5  74.5   7.5  48.5
2            34.0  25.0  46.5  70.0  48.0  59.0